Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: འཇིག་རྟེན་མགོན་པོ་བསྙེངས་པ་མེད་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཡེ་ཤེས་ཚོགས་ཞེས་བྱ། །
en: The protector of the world Abhaya Will be born in a place called Gathering of Wisdom.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །བདུན་ཅུ་རྩ་གཉིས་ཡབ་ནི་མཐུ་ལྡན་ཡིན། །འགྲོ་བས་མཆོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be kṣatriya, And his light will extend seventy-two leagues. Powerful will be his father, and Worshiped by the World will be this victor’s mother.

source: སྲས་པོ་བྱམས་ལྡན་སྐྱོན་མེད་རིམ་གྲོ་པ། །
en: Loving will be his son and Flawless his attendant.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །བདུད་ཀྱི་དཔུང་དག་དཔུང་མེད་བྱེད་པ་པོ། །བྱེ་བ་ཕྲག་ནི་ཁྲི་ཕྲག་བཅུ་བཅུ་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering one trillion “Annihilators of the armies of the māras.

source: རྒྱལ་བའི་དམ་ཆོས་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །དགུ་བཅུ་རྩ་དྲུག་བར་དུ་གནས་པར་འགྱུར། །
en: And the sacred Dharma of this victor Will remain for ninety-six thousand years.

source: ལྷ་མི་དག་ལ་ཕན་ཕྱིར་རྒྱལ་བ་ཡི། །སྐུ་གདུང་རྒྱས་ཤིང་རྣམ་པར་གང་བར་འགྱུར། །
en: “To benefit gods and humans, the relics of this victor Will be abundant, filling the realms.

source: དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་ཆེན་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་འཇིག་རྟེན་ལྟ་ཞེས་བྱ། །
en: The thus-gone Mahādarśana Will be born in a place called Viewing the World.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །དགུ་བཅུ་རྩ་དགུ་གཟི་བརྗིད་བཟང་པོ་ཡབ། །ཟླ་ལྟ་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend ninety-nine leagues. Splendid Excellence will be his father, and Viewing the Moon will be this victor’s mother.

source: སྲས་པོ་བློ་ལྡན་བློ་བཟངས་རིམ་གྲོ་པ། །
en: Intelligent will be his son and Excellent Mind his attendant.

source: ཡེ་ཤེས་འགྲོས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Progress in Wisdom will be the scholar

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་གཉིས་ཀུན་ལའང་། །ཆགས་མེད་དངོས་པོ་མེད་པར་སོང་བ་པོ། །བྱེ་ཕྲག་སུམ་ཅུ་གཉིས་གཉིས་ཚང་བར་ཡོད། །
en: There will be sixty-two consecutive congregations, Each of them gathering three hundred twenty million “Who are free from attachment and have gone beyond entities.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་དྲུག་པ་གསེར་གྱི་བླ་རེར་ལྡན། །
en: “The relics of this victor will reside in a single stūpa Six leagues large and adorned with golden canopies.

source: དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབྱངས་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་མཆོད་རྟེན་མཆོད་ཅེས་བྱ། །
en: The thus-gone Brahmaruta Will be born in a place called Stūpa Worship.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །བདུན་ཅུ་རྩ་གཉིས་ཡབ་ནི་ཚངས་བཟངས་ཡིན། །ཆོས་ཀྱི་དབང་ཕྱུག་མ་ནི་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend seventy-two leagues. Excellent Brahmā will be his father, and Lady Who Masters the Dharma will be this victor’s mother.

source: སྲས་པོ་ཁ་སྒྱུར་ཕམ་མེད་རིམ་གྲོ་པ། །
en: Leader will be his son and Invincible his attendant.

source: དགྲ་འཇོམས་པ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Defeater of the Enemy will be the scholar

source: འཇིག་རྟེན་འཇིགས་པ་མེད་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Free from Mundane Fear the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་གཉིས་ཀུན་ལའང་། །སྲིད་གསུམ་རྣམ་གྲོལ་ཡིད་ལྡན་མི་སློབ་པར། །ཐེར་འབུམ་ཐེར་འབུམ་དག་ནི་ཡོད་པར་འགྱུར། །
en: There will be seventy-two consecutive congregations, Each of them gathering one billion “Whose minds are liberated from the three realms and beyond training.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་བདུན་ཁྲི་ཚང་བར་གནས་པར་འགྱུར། །
en: And when this teacher has attained parinirvāṇa His sacred Dharma will remain complete for seventy thousand years.

source: ལྷ་མི་དག་ལ་ཕན་དང་བདེ་བའི་ཕྱིར། །རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་པར་འགྱུར། །
en: “In order to bring happiness and improvement to gods and humans, The relics of this victor will be abundant.

source: འཇིག་རྟེན་མཆོག་མ་དབྱངས་ནི་བཟང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཡིད་འོང་ལྡན་ཞེས་བྱ། །
en: The one who is supreme in the world, Sughoṣa, Will be born in a place called Attractive.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་རྩ་གཉིས་ཡབ་ནི་ཚངས་བཟངས་ཡིན། །གྲགས་ལྡན་ང་རོ་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend thirty-two leagues. Excellent Brahmā will be his father, and Famed Roar will be this victor’s mother.

source: སྲས་པོ་རབ་ཞི་ལེགས་ཞི་རིམ་གྲོ་པ། །
en: Highest Peace will be his son and Excellent Peace his attendant.

source: རབ་ཞི་དགའ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Joy of the Highest Peace will be the scholar

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་དྲུག་ཀུན་ལའང་། །འཇིག་རྟེན་ཕན་ཕྱིར་གནས་པའི་དགྲ་བཅོམ་པ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་གཉིས་གཉིས་ཡོད། །
en: There will be thirty-six consecutive congregations, Each of them gathering three hundred twenty million “Worthy ones who abide for the benefit of the world.

source: དམ་ཆོས་ལོ་གྲངས་ཉི་ཁྲི་དྲུག་སྟོང་གནས། །
en: And the sacred Dharma will remain for twenty-six thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་གི་མཆོད་རྟེན་ནི། །དཔག་ཚད་བརྒྱ་པ་གཅིག་ནི་འབྱུང་འགྱུར་ཏེ། །རིན་ཆེན་སྟོང་སྙེད་དག་གིས་རྣམ་པར་སྤྲས། །
en: “The relics of this victor will reside in a single stūpa One hundred leagues large and studded with thousands of jewels.

source: རྒྱལ་བ་ཤེས་རབ་ཆེན་པོའི་སྟེགས་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་འཇིག་རྟེན་ཚོགས་ཞེས་བྱ། །
en: The victorious Mahā­prajñā­tīrtha Will be born in a place called Gathering of the World.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་ཡབ་ནི་བློ་གྲོས་ཅན། །ཤེས་རབ་མཆོག་མ་རྒྱལ་ཡུམ་ཤེས་རབ་ཅན། །སྲས་ཡིན་ཤེས་རབ་བཟང་པོ་རིམ་གྲོ་པ། །
en: “His family will be kṣatriya, And his light will extend twenty-two leagues. Intelligent will be his father, and Supreme Insight will be this victor’s mother. Endowed with Insight will be his son and Excellent Insight his attendant.

source: ཤེས་རབ་སྣང་བར་བྱེད་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Illuminating Insight the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་སྟེ་ཀུན་ལ་ཡང་། །རྒྱ་མཚོ་ལྟ་བུའི་བློ་དང་ལྡན་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་བཞི་བཞི་ཡོད། །
en: There will be ten consecutive congregations, Each of them gathering seven hundred forty million “Who are endowed with oceans of wisdom.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ལ། །དཔག་ཚད་སུམ་ཅུ་པ་སྟེ་གསེར་ལས་བྱས། །མུ་ཏིག་བླ་རེར་ལྡན་ཞིང་གསེར་གྱིས་སྤྲས། །
en: The relics of this victor will reside in a single stūpa “Thirty leagues large, made of gold, And adorned with pearl canopies and golden decorations.

source: དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་ཟླ་མེད་པའི། །སྐྱེ་བའི་ཡུལ་ནི་མཁས་པས་མཆོད་ཅེས་བྱ། །
en: The thus-gone Asamabuddhi Will be born in a place called Worshiped by the Learned.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ལྟེ་བ་བཟང་པོ་ཡབ། །ཡོན་ཏན་མཆོད་རྟེན་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be kṣatriya, And his light will extend one hundred leagues. Excellent Center will be his father, and Stūpa of Qualities will be this victor’s mother.

source: སྲས་པོ་བློ་ལྡན་དྲན་ལྡན་རིམ་གྲོ་པ། །
en: Intelligent will be his son and Mindful his attendant.

source: བྱང་ཆུབ་འོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Light of Awakening will be the scholar

source: ཡེ་ཤེས་འོད་བྱེད་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Shining Wisdom the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ཀུན་ལ་ཡང་། །འཁྲུལ་མེད་ཡོན་ཏན་ཕ་རོལ་ཕྱིན་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་དྲུག་དྲུག་ཡོད། །
en: There will be seventy consecutive congregations, Each of them gathering seven hundred sixty million “Who have perfected the qualities free from delusion.

source: བདེན་པ་གསུང་བ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་བདུན་ཁྲིར་གནས་པར་འགྱུར། །
en: And after this teacher of the truth has attained nirvāṇa His sacred Dharma will remain for seventy thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་གྲངས་ནི་ཐེར་འབུམ་དགུ་བཅུ་འབྱུང་། །
en: “The relics of this victor will be abundant, And the stūpas will number ninety billion.

source: དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེ་མཁྲེགས་པ་ཡི། །སྐྱེ་ཡུལ་རབ་ཏུ་འདུལ་བར་དཀའ་ཞེས་བྱ། །
en: The thus-gone Acalaprajñābha Will be born in a place called Hard to Subdue.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་དབྱེར་མེད་ཡིན། །མི་ཐུབ་ཐུབ་ནི་རྒྱལ་ཡུམ་བསམ་གཏན་འགྲོ། །སྲས་ཡིན་ཆགས་པ་མེད་པ་རིམ་གྲོ་པ། །
en: “The family of this victor will be brahmin, And his light will extend one hundred leagues. Inseparable will be his father, and Capable of the Impossible will be this victor’s mother. Meditative Movement will be his son and Detached his attendant.

source: མཐུ་རྩལ་བརྟན་པོ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Firm Strength will be the scholar

source: འགྲོས་མི་འཁྱིལ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Disentangled Mode the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །མཆོག་ཏུ་ཞི་བར་ཕྱིན་པའི་བསམ་གཏན་པ། །བྱེ་བ་ཕྲག་ནི་བརྒྱད་ཅུ་བཞི་བཞི་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering eighty hundred forty million meditators “Who have reached supreme peace.

source: སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་བཅུ་གཅིག་པ། །གཅིག་སྟེ་རིན་ཆེན་བརྒྱ་སྙེད་དག་གིས་སྤྲས། །
en: “The stūpa containing the relics of this victor Will be eleven leagues large and studded with hundreds of jewels.

source: དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་བློ་གྲོས་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་བློ་གྲོས་འཆང་ཞེས་བྱ། །
en: The thus-gone Buddhimati Will be born in a place called Holder of Intelligence.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་ཡབ་ནི་ཤེད་བུ་ཡིན། །སྤོས་ལྡན་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be kṣatriya, And his light will extend twenty-two leagues. Human will be his father, and Fragrant will be this victor’s mother.

source: སྲས་པོ་བློ་ལྡན་བློ་ཆེན་རིམ་གྲོ་པ། །
en: Intelligent will be his son and Great Mind his attendant.

source: བྱང་ཆུབ་རྒྱལ་མཚན་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Banner of Awakening will be the scholar

source: བྱང་ཆུབ་ཚོགས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Gathering of Awakening the one of miracles.

source: འདུས་པ་ལན་གྲངས་དགུ་བཅུ་གཉིས་ཀུན་ལའང་། །ཁུར་བོར་རྣམ་པར་གྲོལ་བར་ཕྱིན་པ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་དགུ་བཅུ་ཡོད། །
en: There will be ninety-two consecutive congregations, Each of them gathering nine hundred million “Who have progressed to shed their loads.

source: མི་ཡི་མཆོག་མ་ལྗོན་ཤིང་དབང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་དབང་པོ་སྣང་ཞེས་བྱ། །
en: The supreme human, Drumendra, Will be born in a place called Light of the Ruler.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་རྒྱལ་བའི་དབང་པོ་ཡབ། །ཡོན་ཏན་ཚོགས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be brahmin, And his light will extend one hundred leagues. Ruler of Victors will be his father, and Gathering of Qualities will be this victor’s mother.

source: སྲས་པོ་སྐར་མཁན་ལེགས་སྣང་རིམ་གྲོ་པ། །
en: Astrologer will be his son and Excellent Light his attendant.

source: འཇིགས་པ་མེད་པའི་ཕྲུག་གུ་རྫུ་འཕྲུལ་ཅན། །
en: And Fearless Child the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་ཀུན་ལ་ཡང་། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་བཞི་བཞི་ཡོད། །གཞན་ཡང་བརྒྱད་ཁྲི་བརྒྱད་ཁྲི་འདུས་པར་འགྱུར། །
en: There will be thirty consecutive congregations, Each of them gathering seven hundred forty million. “Additionally, there will be gatherings of eighty thousand.

source: ཡོན་ཏན་མཐའ་ཡས་པ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་ཉི་ཁྲི་ཉིས་སྟོང་གནས་པར་འགྱུར། །
en: And the sacred Dharma of this teacher of infinite qualities Will remain for twenty-two thousand years.

source: ལྷ་མི་དག་ལ་ཕན་ཞིང་བདེ་བའི་ཕྱིར། །རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་པར་འགྱུར། །
en: “For the sake of bringing help and happiness to gods and humans The relics of this victor will be abundant.

source: དེ་བཞིན་གཤེགས་པ་གདངས་སྙན་སྐྱེ་བའི་ཡུལ། །ཡིད་དུ་འོང་བའི་དབྱངས་དང་ལྡན་ཞེས་བྱ། །
en: The thus-gone Ghoṣasvara Will be born in a place called Endowed with Lovely Melody.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བདུན་ཅུ་རབ་ཏུ་དགའ་བ་ཡབ། །མཆོག་མཐོང་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be brahmin, And his light will extend seventy leagues. Thoroughly Joyous will be his father, and Supreme Seeing will be this victor’s mother.

source: སྲས་པོ་རྒྱལ་མཆོག་ཆོས་ཅན་རིམ་གྲོ་པ། །
en: Supreme Victor will be his son and Endowed with Dharma his attendant.

source: བདུད་རྩི་ང་རོ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Nectar Roar will be the scholar

source: འཕགས་པས་བསྔགས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Praised by Noble Beings the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་ཞི་བ་གཏི་མུག་མེད་གྱུར་པ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering two hundred twenty million “Serene worthy ones who are free from dullness.

source: ཆགས་པ་མེད་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་ཉི་ཁྲི་ཉིས་སྟོང་བར་དུ་གནས། །
en: And the sacred Dharma of the one who has gone beyond attachment Will remain for twenty-two thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་གི་མཆོད་རྟེན་ནི། །དཔག་ཚད་བདུན་ཅུ་རྩ་བདུན་པ་གཅིག་འབྱུང་། །
en: “The stūpa containing the relics of this victor Will be seventy-seven leagues large.

source: དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་སྟོབས་དག་གི། །སྐྱེ་ཡུལ་བསོད་ནམས་སྣང་བར་བྱེད་ཅེས་བྱ། །
en: The thus-gone Puṇyabala Will be born in a place called Illuminating Merit.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །བདུན་ཅུ་རྩ་གསུམ་ཡབ་ནི་བསོད་ནམས་འོད། །བསོད་ནམས་ཟླ་བ་རྒྱལ་བའི་ཡུམ་ཡང་ཡིན། །
en: “His family will be kṣatriya, And his light will extend seventy-three leagues. Light of Merit will be his father, and Moon of Merit will be this victor’s mother.

source: བློ་ཆེན་འོད་ནི་བློ་གྲོས་ཅན་ཡིན་ཏེ། །
en: “Light of the Great Mind will be the one of intelligence

source: བློ་གྲོས་རྣམ་པར་གྲོལ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Liberated Intelligence the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་དྲུག་ཀུན་ལའང་། །སྲིད་པ་ཀུན་ལ་ཆགས་བྲལ་ཡིད་ལྡན་པ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་བཞི་བཞི་ཡོད། །
en: There will be sixty-six consecutive congregations, Each of them gathering nine hundred forty million “Whose minds are completely free from attachment to existence.

source: སངས་རྒྱས་ཡོངས་སུ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས། །
en: And after this buddha has attained nirvāṇa His sacred Dharma will remain for eighty thousand years.

source: དེ་བཞིན་གཤེགས་པ་མཐུ་ཡི་དཔལ་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་བརྟན་པར་སྣང་ཞེས་བྱ། །
en: The thus-gone Sthāmaśrī Will be born in a place called Enduring Light.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་དཔག་ཚད། །དགུ་བཅུ་རྩ་གཉིས་ཡབ་ནི་ལེགས་མཐུ་ཡིན། །ཡོན་ཏན་མཐུ་བདག་རྒྱལ་ཡུམ་ཡང་དག་གནས། །སྲས་ཡིན་གནས་པའི་དབང་པོ་རིམ་གྲོ་པ། །
en: “The family of this victor will be kṣatriya, And his light will extend ninety-two leagues. Excellent Power will be his father, and Lady of Powerful Qualities will be this victor’s mother. True Abiding will be his son and Abiding Ruler his attendant.

source: ཡེ་ཤེས་གནས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Abode of Wisdom will be the expert

source: མཐུ་རྩལ་ལེགས་པར་གནས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Excellent Presence of Power the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་ཐམས་ཅད་རྣམ་པར་གྲོལ་གྱུར་པ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་བཞི་བཞི་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering nine hundred forty million worthy ones “Who have all attained liberation.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་བདུན་ཁྲི་ལྔ་སྟོང་བར་དུ་གནས། །
en: And after this teacher has attained parinirvāṇa His sacred Dharma will remain for seventy-five thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བརྒྱད་པ་གསེར་ལས་བྱས་པ་ཡིན། །
en: “The relics of this victor will reside in a single stūpa Eight leagues large and made of gold.

source: དེ་བཞིན་གཤེགས་པ་འཕགས་པ་དགྱེས་པ་ཡི། །སྐྱེ་ཡུལ་དྲང་སྲོང་དད་པར་བྱེད་ཅེས་བྱ། །
en: The thus-gone Āryapriya Will be born in a place called Instiller of Faith in the Sages.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་ལྷ་བཟང་ཡིན། །དགྲ་བཅོམ་མཆོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be brahmin, And his light will extend one hundred leagues. Divine Excellence will be his father, and Worship of the Worthy will be this victor’s mother.

source: སྲས་པོ་མཆོད་པ་མཆོད་ལྡན་རིམ་གྲོ་པ། །
en: Worship will be his son and Worship Possessor his attendant.

source: འཕགས་པའི་འོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Light of Noble Beings will be the scholar

source: འཕགས་པ་དད་པར་བྱེད་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Instiller of Faith in Noble Beings the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་དྲུག་ཀུན་ལའང་། །ཉོན་མོངས་གསུམ་གྱི་དྲི་མ་མེད་གྱུར་པ། །དེ་དག་ཐེར་འབུམ་ཐེར་འབུམ་འདུས་པར་འགྱུར། །
en: There will be sixty-six consecutive congregations, Each of them gathering one billion “Who are free from the stains of the three defilements.

source: མྱ་ངན་འདས་ནས་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་དགུ་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: And after this teacher has attained nirvāṇa His sacred Dharma will remain for ninety thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་བྱིན་གྱིས་བརླབས་ནས་ཀྱང་། །འཇིག་རྟེན་སྐུ་གདུང་རྒྱས་ཤིང་གང་བར་འགྱུར། །
en: “The blessed relics of this victor Will be abundant, filling the realms.

source: འཇིག་རྟེན་མགོན་པོ་མཐུ་སྟོབས་སྐྱེ་བ་ཡི། །ཡུལ་ནི་ཡོན་ཏན་སྣང་བར་བྱེད་ཅེས་བྱ། །
en: The protector of the world, Pratapta, Will be born in a place called Illuminating Qualities.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་ལྷ་བཟང་ཡིན། །ལྷ་མཆོད་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be brahmin, And his light will extend ten leagues. Divine Excellence will be his father, and Divine Worship will be this victor’s mother.

source: སྲས་པོ་སྒྲ་གཅན་སྐར་མ་རིམ་གྲོ་པ། །
en: Rāhu will be his son and Star his attendant.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ཀུན་ལ་ཡང་། །རྫུ་འཕྲུལ་རྐང་བཞིས་ཕ་རོལ་ཕྱིན་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་བཞི་བཞི་ཡོད། །
en: There will be seventy consecutive congregations, Each of them gathering seven hundred forty million “Who have reached perfection with the four bases of miraculous power.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་ལྔ་པ་གསེར་གྱི་མགོ་རྒྱན་ལྡན། །
en: “The relics of this victor will reside in a single stūpa Five leagues large and adorned with golden top ornaments.

source: སངས་རྒྱས་སྐར་མ་ལ་ནི་དགྱེས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་འོད་འཕྲོ་སྣང་ཞེས་བྱ། །
en: The buddha Jyotīrāma Will be born in a place called Radiant Light.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་ལྷ་བཟང་ཡིན། །མཆོག་མཆོད་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be kṣatriya, And his light will extend ten leagues. Divine Excellence will be his father, and Supreme Worship will be this victor’s mother.

source: སྲས་པོ་ལྟ་བྱེད་འོད་འཕྲོ་རིམ་གྲོ་པ། །
en: Seer will be his son and Radiant his attendant.

source: གནས་པ་མཐའ་ཡས་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Infinite Abiding the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་དྲུག་ཀུན་ལའང་། །མཚོ་ལྟར་གང་བའི་བསམ་གཏན་པ་ཡི་གྲངས། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་བཞི་བཞི་ཡོད། །
en: There will be thirty-six consecutive congregations, Each of them gathering seven hundred forty million “Meditators who are like brimming seas.

source: རྒྱལ་བ་ཡོངས་སུ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་སུམ་ཁྲིའི་བར་དུ་གནས། །
en: And after this victor has attained parinirvāṇa His sacred Dharma will remain for thirty thousand years.

source: དེ་བཞིན་གཤེགས་པ་སྤྲིན་གྱི་རྔ་སྒྲ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བདུད་རྩིའི་དབྱངས་ཞེས་བྱ། །
en: The thus-gone Dundubhi­megha­svara Will be born in a place called Nectar Melody.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །དགུ་བཅུ་རྩ་གཉིས་ཡབ་ནི་ལེགས་བཟང་ཡིན། །གདངས་སྙན་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend ninety-two leagues. Exquisite Excellence will be his father, and Delightful Tones will be this victor’s mother.

source: སྲས་པོ་ལེགས་མཐོང་དགའ་སྦྱངས་རིམ་གྲོ་པ། །
en: Excellent Sight will be his son and Refined Joy his attendant.

source: ཆོས་ངེས་པ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Certain Dharma the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་ཐམས་ཅད་ཆགས་པ་མེད་གྱུར་པ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་གཉིས་གཉིས་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering three hundred twenty million “Worthy ones who are all free from attachment.

source: མཐའ་ཡས་འདུལ་བར་མཛད་པའི་དམ་ཆོས་དག །ལོ་གྲངས་ཉི་ཁྲི་སུམ་སྟོང་བར་དུ་གནས། །
en: And the sacred Dharma of this infinite tamer Will remain for twenty-three thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་དྲུག་པ་ཁོར་ཡུག་བླ་རེར་ལྡན། །
en: “The relics of this victor will reside in a single stūpa Six leagues large and adorned with golden canopies.

source: དེ་བཞིན་གཤེགས་པ་སྤྱན་སྡུག་པ་ཡི་ཞལ། །སྐྱེ་བའི་ཡུལ་ནི་མཐོང་བས་མཆོད་ཅེས་བྱ། །
en: The thus-gone Priya­cakṣurvaktra Will be born in a place called Worship through Seeing.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་སྤྱན་ལེགས་ཡིན། །མིག་སྦྱིན་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be brahmin, And his light will extend one hundred leagues. Excellent Eye will be his father, and Eye Gift will be this victor’s mother.

source: སྲས་པོ་འཇིག་རྟེན་ཆགས་མེད་རིམ་གྲོ་པ། །
en: World will be his son and Detached his attendant.

source: ཡོན་ཏན་མཐོང་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Seeing Qualities will be the scholar

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་ཀུན་ལ་ཡང་། །ཐེག་པ་མཆོག་གིས་ལེགས་གནས་འབྲས་ཐོབ་པ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་དགུ་དགུ་ཡོད། །
en: There will be sixty consecutive congregations, Each of them gathering nine hundred ninety million “Who have attained the fruition of excellent abiding by means of the supreme vehicle.

source: མི་ཚེ་ལོ་གྲངས་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡིན། །
en: The lifespan of humans will be eighty-four thousand years,

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ཏེ། །ཞིང་གྲངས་སྟོང་སྙེད་དག་ཏུ་གང་བར་འགྱུར། །
en: “The relics of this victor will be abundant, Filling thousands of realms.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་བཟང་ལྡན་གྱི། །སྐྱེ་ཡུལ་ཡེ་ཤེས་སྒྲོན་མ་ཞེས་ཀྱང་བྱ། །
en: The thus-gone Sujñāna Will be born in a place called Lamp of Wisdom.

source: དེའི་རིགས་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བདུན་ཅུ་ཡེ་ཤེས་སྐར་མདའ་ཡབ། །ཡེ་ཤེས་དབང་ཕྱུག་མ་ནི་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend seventy leagues. Wisdom Meteor will be his father, and Powerful Lady of Wisdom will be this victor’s mother.

source: སྲས་པོ་ཤེས་དགའ་ཤེས་འབྱོར་རིམ་གྲོ་པ། །
en: Knowledge Joy will be his son and Knowledge Wealth his attendant.

source: ཡེ་ཤེས་འབྱུང་གནས་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Source of Wisdom will be the scholar

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ཁོར་ཡུག་ལྟ་བུར་གཡོ་བ་མེད་པ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་བཞི་བཞི་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering nine hundred forty million “Who remain unshakable like the ring around the world.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བརྒྱ་པ་ཁོར་ཡུག་བླ་རེར་ལྡན།། །།
en: “The relics of this victor will reside in a single stūpa One hundred leagues large and adorned with canopies.

source: འཇིག་རྟེན་བླ་མ་འབྱོར་པར་ལྡན་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་རིན་ཆེན་བརྒྱན་ཅེས་བྱ། །
en: The world’s teacher, Samṛddha, Will be born in a place called Adorned with Jewels.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་ཡབ་ནི་བློ་གྲོས་ཅན། །ཡོན་ཏན་ཚོགས་ནི་རྒྱལ་ཡུམ་ཡོན་ཏན་མཆོག །སྲས་ཡིན་ཡོན་ཏན་གཟི་བརྗིད་རིམ་གྲོ་པ། །
en: “His family will be kṣatriya, And his light will extend twenty-two leagues. Intelligent will be his father, and Gathering of Qualities will be this victor’s mother. Supreme Qualities will be his son and Qualities of Splendor his attendant.

source: ཡོན་ཏན་གཟི་བརྗིད་འཆང་བ་བློ་ཅན་ཏེ། །
en: “Holder of the Qualities of Splendor will be the scholar

source: ཡོན་ཏན་ཀུན་གྱིས་མཆོད་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Worship through All Qualities the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ཀུན་ལ་ཡང་། །སྲེད་ལྕུགས་དྲ་བ་དག་ལས་གྲོལ་བ་པོ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་བདུན་ཅུ་ཡོད། །
en: There will be seventy consecutive congregations, Each of them gathering seven hundred million “Who are free from the web of attached engagements.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་བརྒྱད་ཁྲི་བདུན་སྟོང་བར་དུ་གནས། །
en: And when this teacher has attained nirvāṇa His sacred Dharma will remain for eighty-seven thousand years.
